tinyvision-ai-inc/pico-ice-sdk/example/micro_ros_ws/src/pico-sdk/lib/tinyusb/hw/mcu/nxp/nxp_sdk/devices/MKL25Z4/cmsis_drivers/fsl_lpsci_cmsis.c
            if (!lpsci->isPowerOn)
            {
                LPSCI_GetDefaultConfig(&config);
                config.enableTx = true;
                config.enableRx = true;

                LPSCI_Init(lpsci->resource->base, &config, lpsci->resource->GetFreq());
                LPSCI_TransferCreateHandle(lpsci->resource->base, lpsci->handle, KSDK_LPSCI_NonBlockingCallback,
                                           (void *)lpsci->cb_event);
                lpsci->isPowerOn = true;
                lpsci->isConfigured = true;
            }
            break;

        default:
            return ARM_DRIVER_ERROR_UNSUPPORTED;
    }

    return ARM_DRIVER_OK;
}

static int32_t LPSCI_NonBlockingSend(const void *data, uint32_t num, cmsis_lpsci_interrupt_driver_state_t *lpsci)
{
    int32_t ret;
    status_t status;
    lpsci_transfer_t xfer;

    xfer.data = (uint8_t *)data;
    xfer.dataSize = num;

    status = LPSCI_TransferSendNonBlocking(lpsci->resource->base, lpsci->handle, &xfer);

    switch (status)
    {
        case kStatus_Success:
            ret = ARM_DRIVER_OK;
            break;

        case kStatus_InvalidArgument:
            ret = ARM_DRIVER_ERROR_PARAMETER;
            break;

        case kStatus_LPSCI_TxBusy:
            ret = ARM_DRIVER_ERROR_BUSY;
            break;

        default:
            ret = ARM_DRIVER_ERROR;
            break;
    }

    return ret;
}

static int32_t LPSCI_NonBlockingReceive(void *data, uint32_t num, cmsis_lpsci_interrupt_driver_state_t *lpsci)
{
    int32_t ret;
    status_t status;
    lpsci_transfer_t xfer;

    xfer.data = data;
    xfer.dataSize = num;

    status = LPSCI_TransferReceiveNonBlocking(lpsci->resource->base, lpsci->handle, &xfer, NULL);

    switch (status)
    {
        case kStatus_Success:
            ret = ARM_DRIVER_OK;
            break;

        case kStatus_InvalidArgument:
            ret = ARM_DRIVER_ERROR_PARAMETER;
            break;

        case kStatus_LPSCI_RxBusy:
            ret = ARM_DRIVER_ERROR_BUSY;
            break;

        default:
            ret = ARM_DRIVER_ERROR;
            break;
    }

    return ret;
}

static int32_t LPSCI_NonBlockingTransfer(const void *data_out,
                                         void *data_in,
                                         uint32_t num,
                                         cmsis_lpsci_interrupt_driver_state_t *lpsci)
{
    /* Only in synchronous mode */
    return ARM_DRIVER_ERROR;
}

static uint32_t LPSCI_NonBlockingGetTxCount(cmsis_lpsci_interrupt_driver_state_t *lpsci)
{
    uint32_t cnt;

    /* If TX not in progress, then the TX count is txDataSizeAll saved in handle. */
    if (kStatus_NoTransferInProgress == LPSCI_TransferGetSendCount(lpsci->resource->base, lpsci->handle, &cnt))
    {
        cnt = lpsci->handle->txDataSizeAll;
    }

    return cnt;
}

static uint32_t LPSCI_NonBlockingGetRxCount(cmsis_lpsci_interrupt_driver_state_t *lpsci)
{
    uint32_t cnt;

    if (kStatus_NoTransferInProgress == LPSCI_TransferGetReceiveCount(lpsci->resource->base, lpsci->handle, &cnt))
    {
        cnt = lpsci->handle->rxDataSizeAll;
    }

    return cnt;
}

static int32_t LPSCI_NonBlockingControl(uint32_t control, uint32_t arg, cmsis_lpsci_interrupt_driver_state_t *lpsci)
{
    /* Must be power on. */
    if (!lpsci->isPowerOn)
    {
        return ARM_DRIVER_ERROR;
    }

    /* Does not support these features. */
    if (control & (ARM_USART_FLOW_CONTROL_Msk | ARM_USART_CPOL_Msk | ARM_USART_CPHA_Msk))
    {
        return ARM_DRIVER_ERROR_UNSUPPORTED;
    }

    switch (control & ARM_USART_CONTROL_Msk)
    {
        /* Abort Send */
        case ARM_USART_ABORT_SEND:
            LPSCI_TransferAbortSend(lpsci->resource->base, lpsci->handle);
            return ARM_DRIVER_OK;

        /* Abort receive */
        case ARM_USART_ABORT_RECEIVE:
            LPSCI_TransferAbortReceive(lpsci->resource->base, lpsci->handle);
            return ARM_DRIVER_OK;

        default:
            break;
    }

    return LPSCI_CommonControl(control, arg, lpsci->resource, &lpsci->isConfigured);
}

static ARM_USART_STATUS LPSCI_NonBlockingGetStatus(cmsis_lpsci_interrupt_driver_state_t *lpsci)
{
    ARM_USART_STATUS stat;
    uint32_t ksdk_lpsci_status = LPSCI_GetStatusFlags(lpsci->resource->base);

    stat.tx_busy = ((kLPSCI_TxBusy == lpsci->handle->txState) ? (1U) : (0U));
    stat.rx_busy = ((kLPSCI_RxBusy == lpsci->handle->rxState) ? (1U) : (0U));

    stat.tx_underflow = 0U;
    stat.rx_overflow = (!(!(ksdk_lpsci_status & kLPSCI_RxOverrunFlag)));
#if defined(FSL_FEATURE_LPSCI_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPSCI_HAS_LIN_BREAK_DETECT
    stat.rx_break = (!(!(ksdk_lpsci_status & kLPSCI_LinBreakFlag)));
#else
    stat.rx_break = 0U;
#endif
    stat.rx_framing_error = (!(!(ksdk_lpsci_status & kLPSCI_FramingErrorFlag)));
    stat.rx_parity_error = (!(!(ksdk_lpsci_status & kLPSCI_ParityErrorFlag)));

    return stat;
}

#endif

#if defined(UART0) && RTE_USART0

/* User needs to provide the implementation for UART0_GetFreq/InitPins/DeinitPins 
in the application for enabling according instance. */ 
extern uint32_t UART0_GetFreq(void);
extern void UART0_InitPins(void);
extern void UART0_DeinitPins(void);

cmsis_lpsci_resource_t UART0_Resource = {UART0, UART0_GetFreq};

#if RTE_USART0_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_lpsci_dma_resource_t UART0_DmaResource = {
    RTE_USART0_DMA_TX_DMA_BASE, RTE_USART0_DMA_TX_CH, RTE_USART0_DMA_TX_DMAMUX_BASE, RTE_USART0_DMA_TX_PERI_SEL,

    RTE_USART0_DMA_RX_DMA_BASE, RTE_USART0_DMA_RX_CH, RTE_USART0_DMA_RX_DMAMUX_BASE, RTE_USART0_DMA_RX_PERI_SEL,
};

lpsci_dma_handle_t UART0_DmaHandle;
dma_handle_t UART0_DmaRxHandle;
dma_handle_t UART0_DmaTxHandle;

#if defined(__CC_ARM)
ARMCC_SECTION("uart0_dma_driver_state")
cmsis_lpsci_dma_driver_state_t UART0_DmaDriverState = {
#else
cmsis_lpsci_dma_driver_state_t UART0_DmaDriverState = {
#endif
    &UART0_Resource, &UART0_DmaResource, &UART0_DmaHandle, &UART0_DmaRxHandle, &UART0_DmaTxHandle,
};

static int32_t UART0_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART0_InitPins();
    return LPSCI_DmaInitialize(cb_event, &UART0_DmaDriverState);
}

