tinyvision-ai-inc/pico-ice-sdk/example/micro_ros_ws/src/pico-sdk/lib/tinyusb/hw/mcu/nxp/nxp_sdk/devices/MKL25Z4/cmsis_drivers/fsl_lpsci_cmsis.c
static int32_t UART0_DmaUninitialize(void)
{
    UART0_DeinitPins();
    return LPSCI_DmaUninitialize(&UART0_DmaDriverState);
}

static int32_t UART0_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPSCI_DmaPowerControl(state, &UART0_DmaDriverState);
}

static int32_t UART0_DmaSend(const void *data, uint32_t num)
{
    return LPSCI_DmaSend(data, num, &UART0_DmaDriverState);
}

static int32_t UART0_DmaReceive(void *data, uint32_t num)
{
    return LPSCI_DmaReceive(data, num, &UART0_DmaDriverState);
}

static int32_t UART0_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSCI_DmaTransfer(data_out, data_in, num, &UART0_DmaDriverState);
}

static uint32_t UART0_DmaGetTxCount(void)
{
    return LPSCI_DmaGetTxCount(&UART0_DmaDriverState);
}

static uint32_t UART0_DmaGetRxCount(void)
{
    return LPSCI_DmaGetRxCount(&UART0_DmaDriverState);
}

static int32_t UART0_DmaControl(uint32_t control, uint32_t arg)
{
    return LPSCI_DmaControl(control, arg, &UART0_DmaDriverState);
}

static ARM_USART_STATUS UART0_DmaGetStatus(void)
{
    return LPSCI_DmaGetStatus(&UART0_DmaDriverState);
}

#endif

#else

lpsci_handle_t UART0_Handle;

#if defined(USART0_RX_BUFFER_ENABLE) && (USART0_RX_BUFFER_ENABLE == 1)
static uint8_t uart0_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM)
ARMCC_SECTION("uart0_non_blocking_driver_state")
cmsis_lpsci_interrupt_driver_state_t UART0_NonBlockingDriverState = {
#else
cmsis_lpsci_interrupt_driver_state_t UART0_NonBlockingDriverState = {
#endif
    &UART0_Resource, &UART0_Handle,
};

static int32_t UART0_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
    UART0_InitPins();
    return LPSCI_NonBlockingInitialize(cb_event, &UART0_NonBlockingDriverState);
}

static int32_t UART0_NonBlockingUninitialize(void)
{
    UART0_DeinitPins();
    return LPSCI_NonBlockingUninitialize(&UART0_NonBlockingDriverState);
}

static int32_t UART0_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    uint32_t result;

    result = LPSCI_NonBlockingPowerControl(state, &UART0_NonBlockingDriverState);

#if defined(USART0_RX_BUFFER_ENABLE) && (USART0_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (UART0_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPSCI_TransferStartRingBuffer(UART0_NonBlockingDriverState.resource->base, UART0_NonBlockingDriverState.handle,
                                      uart0_rxRingBuffer, USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t UART0_NonBlockingSend(const void *data, uint32_t num)
{
    return LPSCI_NonBlockingSend(data, num, &UART0_NonBlockingDriverState);
}

static int32_t UART0_NonBlockingReceive(void *data, uint32_t num)
{
    return LPSCI_NonBlockingReceive(data, num, &UART0_NonBlockingDriverState);
}

static int32_t UART0_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSCI_NonBlockingTransfer(data_out, data_in, num, &UART0_NonBlockingDriverState);
}

static uint32_t UART0_NonBlockingGetTxCount(void)
{
    return LPSCI_NonBlockingGetTxCount(&UART0_NonBlockingDriverState);
}

static uint32_t UART0_NonBlockingGetRxCount(void)
{
    return LPSCI_NonBlockingGetRxCount(&UART0_NonBlockingDriverState);
}

static int32_t UART0_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;
    result = LPSCI_NonBlockingControl(control, arg, &UART0_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }
    if (UART0_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        /* Enable the interrupt to accept the data when user need the ring buffer. */
        LPSCI_EnableInterrupts(UART0_NonBlockingDriverState.resource->base, kLPSCI_RxDataRegFullInterruptEnable |
                                                                                kLPSCI_RxOverrunInterruptEnable |
                                                                                kLPSCI_FramingErrorInterruptEnable);
        /* Enable parity error interrupt when parity mode is enable*/
        if (UART0_C1_PE_MASK & UART0_NonBlockingDriverState.resource->base->C1)
        {
            LPSCI_EnableInterrupts(UART0_NonBlockingDriverState.resource->base, kLPSCI_ParityErrorInterruptEnable);
        }
    }
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS UART0_NonBlockingGetStatus(void)
{
    return LPSCI_NonBlockingGetStatus(&UART0_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART0 = {
    LPSCI_GetVersion,      LPSCI_GetCapabilities,
#if RTE_USART0_DMA_EN
    UART0_DmaInitialize,   UART0_DmaUninitialize, UART0_DmaPowerControl, UART0_DmaSend,    UART0_DmaReceive,
    UART0_DmaTransfer,     UART0_DmaGetTxCount,   UART0_DmaGetRxCount,   UART0_DmaControl, UART0_DmaGetStatus,
#else
    UART0_NonBlockingInitialize,
    UART0_NonBlockingUninitialize,
    UART0_NonBlockingPowerControl,
    UART0_NonBlockingSend,
    UART0_NonBlockingReceive,
    UART0_NonBlockingTransfer,
    UART0_NonBlockingGetTxCount,
    UART0_NonBlockingGetRxCount,
    UART0_NonBlockingControl,
    UART0_NonBlockingGetStatus,
#endif
    LPSCI_SetModemControl, LPSCI_GetModemStatus};
#endif
